In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import matplotlib
matplotlib.rcParams["font.family"]="Malgun Gothic"
matplotlib.rcParams["axes.unicode_minus"]=False

In [9]:
df=pd.read_csv("C://Users//whs38//OneDrive//바탕 화면//사이버연수원//births.txt",sep=",",header=None,index_col=0)
df.columns=['남아수','여아수']
df.index.name="연도"
df

          남아수      여아수
연도
1880    90993   110491
1881    91954   100745
1882   107850   113688
1883   112321   104629
1884   129022   114445
...       ...      ...
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

[132 rows x 2 columns]

In [10]:
#1.남아수 총합을 구하시오.
df['남아수'].sum()

161802441

In [11]:
#2.여아수 평균을 구하시오.
df['여아수'].mean()

1245399.2121212122

In [19]:
#3.남아수가 가장많은 연도와 남아수를 구하시오.
max=df["남아수"].max()
df[df['남아수']==max]['남아수']

연도
1957    2044160
Name: 남아수, dtype: int64

In [20]:
#4.2000년도 이후 데이터를 구하시오.
df.loc[2000:]

          남아수      여아수
연도
2000  1814601  1962406
2001  1799049  1941251
2002  1795206  1939815
2003  1825359  1973434
2004  1834145  1982794
2005  1845379  1994841
2006  1898463  2052377
2007  1919408  2072139
2008  1887234  2036289
2009  1832925  1979303
2010  1772738  1913851
2011  1753500  1893230

In [21]:
#5.1995~2000년도 데이터를 구하시오.
df.loc[1995:2000,]

          남아수      여아수
연도
1995  1757927  1902832
1996  1752249  1893378
1997  1739806  1884122
1998  1765915  1910250
1999  1772632  1918809
2000  1814601  1962406

In [22]:
#6.남아출생이 가장많은 top5를 구하시오.(연도와 남아수)
df["남아수"].nlargest(5)

연도
1957    2044160
1959    2023044
1960    2022093
1961    2017316
1958    2010884
Name: 남아수, dtype: int64

In [23]:
#7.남아율 컬럼을 추가하고 각연도별 남아수가 차지하는 비율을 데이터로 보여주시오.
df["남아율(%)"]=(df["남아수"]/df.sum(axis=1))*100
df

          남아수      여아수     남아율(%)
연도
1880    90993   110491  45.161402
1881    91954   100745  47.718981
1882   107850   113688  48.682393
1883   112321   104629  51.772759
1884   129022   114445  52.993630
...       ...      ...        ...
2007  1919408  2072139  48.086819
2008  1887234  2036289  48.100495
2009  1832925  1979303  48.080152
2010  1772738  1913851  48.086131
2011  1753500  1893230  48.084174

[132 rows x 3 columns]

In [28]:
#8.2000년도 이후 데이터에 대해 출생량 컬럼을 추가하고 남아수가 1800000이상이면 많음 아니면 적음이라고 보여주시오.
df1=df.loc[2000:,"남아수"]
df1["출생량"]=df1.apply(lambda v: "많음" if v>=1800000 else "적음")
df1

연도
2000                                              1814601
2001                                              1799049
2002                                              1795206
2003                                              1825359
2004                                              1834145
2005                                              1845379
2006                                              1898463
2007                                              1919408
2008                                              1887234
2009                                              1832925
2010                                              1772738
2011                                              1753500
출생량     연도
2000    많음
2001    적음
2002    적음
2003    많음...
Name: 남아수, dtype: object

In [34]:
#9. 1800년대, 1900년대, 2000년대 각 남아, 여아 수 평균을 구하시오.
df_1=df.loc[1880:1899,"남아수":"여아수"]
df_2=df.loc[1900:1999,"남아수":"여아수"]
df_3=df.loc[2000:,"남아수":"여아수"]

print(df_1.mean(),df_2.mean(),df_3.mean())

남아수    176714.15
여아수    111820.55
dtype: float64 남아수    1362901.51
여아수    1384145.55
dtype: float64 남아수    1.831501e+06
여아수    1.978478e+06
dtype: float64